import os
import pprint


class AddressFilterLevelOne(object):
    def __init__(self):
        """
        第一级地址过滤器，去除一些没意义的字段
        """
        # define useless strings
        self.black_list = (

        )
        self.black_list_len_2 = (
            '--', '..', '0.', '[O', '``', 'na', 'ne', 'qu', '‘’', '“”', "待定", "bt", "sc", "辞了",
            "an", "ss", ".3", "SB", "qq", "F ", "fs", "-\\", "//", "”“",
        )

        self.black_list_len_3 = (
            'EEE', 'WU ', '‘’‘', '、..', "---", "sad", "abc", "HG ", "yyy", "XX市"
        )
        self.black_list_len_4 = (
            '，，，，', "----", "没有地址",
        )

    def filter(self, address_str: str) -> bool:
        """
        传入输入字符串，进行过滤
        :param address_str: 输入地址字符串
        :return: 是否为有效地址
        """
        # 去除空格，全是空格的地址无效
        address_str = address_str.strip(" ")

        # 太短，无意义
        if len(address_str) <= 1:
            return False

        # 全是数字，无意义
        try:
            _ = int(address_str)
        except ValueError:
            pass
        else:
            return False

        if address_str in self.black_list:
            return False
        elif len(address_str) == 2 and address_str in self.black_list_len_2:
            return False
        elif len(address_str) == 3 and address_str in self.black_list_len_3:
            return False
        elif len(address_str) == 4 and address_str in self.black_list_len_4:
            return False

        # 通过了前面的过滤，就是有效的
        return True


class AddressCounter(object):
    def __init__(self):
        """
        地址计数器，统计按省分布的各种区域里有多少人次
        Parse semi-identified address string to universal address string (category by region/province).
        """
        self.dict_counter = {
            # 4个直辖市
            "北京市": 0,
            "天津市": 0,
            "上海市": 0,
            "重庆市": 0,
            # 23个省
            "河北省": 0,
            "山西省": 0,
            "辽宁省": 0,
            "吉林省": 0,
            "黑龙江省": 0,
            "江苏省": 0,
            "浙江省": 0,
            "安徽省": 0,
            "福建省": 0,
            "江西省": 0,
            "山东省": 0,
            "河南省": 0,
            "湖北省": 0,
            "湖南省": 0,
            "广东省": 0,
            "海南省": 0,
            "四川省": 0,
            "贵州省": 0,
            "云南省": 0,
            "陕西省": 0,
            "甘肃省": 0,
            "青海省": 0,
            "台湾省": 0,
            # 5自治区
            "内蒙古自治区": 0,
            "广西壮族自治区": 0,
            "西藏自治区": 0,
            "宁夏回族自治区": 0,
            "新疆维吾尔自治区": 0,
            # 2特别行政区
            "香港特别行政区": 0,
            "澳门特别行政区": 0,
            # extra
            "中国其它地区": 0,

            # 国外
            "美国": 0,
            "日本": 0,
            "澳大利亚": 0,
            "新加坡": 0,
            "韩国": 0,
            "马来西亚": 0,
            "巴基斯坦": 0,
            "新西兰": 0,
            "加拿大": 0,
            "英国": 0,
            "挪威": 0,
            "印度": 0,
            "俄罗斯": 0,
            "白俄罗斯": 0,
            "意大利": 0,
            "土耳其": 0,
            "蒙古": 0,
            "沙特阿拉伯": 0,
            "印度尼西亚": 0,
            "缅甸": 0,
            "德国": 0,
            "捷克共和国": 0,
            "巴西": 0,
            "朝鲜": 0,
            "菲律宾": 0,
        }
        self.alias_dict = {
            # 4个直辖市
            "北京市": (
                "北京", "海淀", "朝阳", "东城区", "大兴", "崇文", "丰台", "通州", "海滨", "石景山", "BEIJING", "beijing",
                "首都", "东花",
            ),
            "天津市": (
                "天津", "东丽", "tianjin", "夭津", "塘沽", "蓟县", "西青", "南开", "TIANJIN",
            ),
            "上海市": (
                "上海", "奉贤", "浦东", "崇明", "虹口", "松江", "宝山", "徐汇", "漕溪", "陆家浜", "杨浦", "宋园", "闵行",
                "嘉定", "长宁", "普陀", "shanghai", "SHANGHAI", "Shanghai",
            ),
            "重庆市": (
                "重庆", "长寿", "九龙坡", "永川", "沙坪坝", "巫溪", "巴南", "渝北", "龙兴",
            ),
            # 23个省
            "河北省": (
                "河北", "唐山", "石家庄", "裕华", "桥东", "新华", "桥西", "辛集", "开平", "张家口", "华龙", "武安", "正定",
                "涞源", "秦皇岛", "衡水", "邢台", "高碑", "遵化", "邯郸", "邯郸", "承德",
            ),
            "山西省": (
                "山西", "万柏林", "太原", "小店", "平鲁", "高平", "清徐", "吕梁", "阳泉", "大同", "朔州", "临汾",
            ),
            "辽宁省": (
                "辽宁", "大连", "沈阳", "甘井子", "立山", "瓦房店", "沙河口", "皇姑", "大东", "鞍山", "铁西", "连山",
                "中山区", "盘锦", "和平区", "liaoning", "铁岭", "海城", "丹东", "辽阳", "锦州", "营口", "抚顺", "阜新",
                "葫芦岛",
            ),
            "吉林省": (
                "吉林", "长春", "南关", "四平", "通化", "jilin",
            ),
            "黑龙江省": (
                "黑龙江", "哈尔滨", "南岗", "道里", "鸡西", "大庆", "双鸭山", "道外", "佳木斯", "爱辉", "五常", "伊春",
                "牡丹江", "齐齐哈尔", "鹤岗", "海林", "双城", "daqing",
            ),
            "江苏省": (
                "江苏", "海门", "南京", "无锡", "苏州", "白下", "泉山", "丹徒", "沧浪", "江阴", "市京", "吴江", "京口",
                "丹阳", "扬中", "淮阴", "清河", "常熟", "扬中", "楚州", "清浦", "京口", "盐城", "吳江", "嵊州", "灌南",
                "常州", "海安", "沭阳", "周铁", "徐州", "南通", "临安", "常州", "台州", "宜兴", "海陵", "靖江", "张家",
                "镇江", "如皋", "东台", "大丰", "如皋", "连云港", "如皋", "淮安", "姜堰", "昆山", "扬州", "蘇州", "范市",
                "邳州", "启东", "江蘇", "常熟", "泰州", "兴化", "永康", "太倉", "wuxi", "江都", "太仓", "句容", "高邮",
                "仪征", "泰兴", "鎮江", "金坛", "宿迁", "溧阳",
            ),
            "浙江省": (
                "浙江", "杭州", "宁波", "绍兴", "江东", "瑞安", "越城", "象山", "温州", "上城", "吴兴", "萧山", "草塔",
                "天台", "宁海", "慈溪", "上虞", "平阳", "武义", "嘉兴", "诸暨", "金华", "zhejiang", "湖州", "余姚", "龙泉",
                "东阳", "平湖", "乐清", "浙", "丽水", "义乌", "桐乡", "建德", "Zhejiang",
            ),
            "安徽省": (
                "安徽", "黄山", "合肥", "鸠江", "颖泉", "迎江", "淮南", "太湖县", "安微", "宿州", "芜湖", "繁昌",
                "马鞍山", "淮北", "蜀山", "当涂", "蚌埠", "庐阳", "安庆", "铜陵", "明光", "桐城", "巢湖", "天长",
                "滁州", "安慶", "宣州",
            ),
            "福建省": (
                "福建", "厦门", "莆田", "晋江", "台江", "长乐", "泉州", "福州", "晋安", "南靖", "仓山", "福清", "武夷山",
                "廈門", "xiamen", "石狮", "福鼎", "南平", "漳州", "福安", "南安",
            ),
            "江西省": (
                "江西", "南昌", "萍乡", "临川", "乐平", "上饶", "吉安", "景德", "九江", "高安", "赣州",
            ),
            "山东省": (
                "山东", "济南", "青岛", "章丘", "奎文", "东营", "平阴", "龙口", "张店", "胶南", "德州", "安丘", "莱山",
                "海阳", "坊子", "章丘", "汶上", "桓台", "寿光", "海阳", "临朐", "城阳", "潍坊", "长清", "長清", "高密",
                "莒县", "天桥", "历下", "临沂", "烟台", "萊陽", "qingdao", "shandong", "淄博", "枣庄", "滨州", "蓬莱",
                "临清", "邹城", "济宁", "锢安", "兖州", "青州", "莱西",
            ),
            "河南省": (
                "河南", "郑州", "河市省", "鹤壁", "洛阳", "伊川", "项城", "开封", "商城县", "何南", "偃师", "唐河", "罗山",
                "澶河", "安阳", "三门峡", "平顶山", "登封", "许昌", "周口", "汝州",
            ),
            "湖北省": (
                "湖北", "武汉", "洪山", "夷陵", "西陵", "江岸", "猇亭", "鄂州", "武昌", "青山", "伍家", "江汉", "黄陂",
                "孝南", "郢中", "黄破", "荆门", "宜昌", "十堰", "利川", "石首", "当阳", "松滋", "仙桃", "随州",
            ),
            "湖南省": (
                "湖南", "长沙", "湖市省", "湘潭", "怀化", "醴陵", "株洲", "雨花", "天心", "涟源", "益阳",
            ),
            "广东省": (
                "广东", "广州", "深圳", "顺德", "万江", "萝岗", "凤岗", "黄浦", "南山", "海珠", "虎门", "韶关", "高埗",
                "厚街", "大朗", "东莞", "沙田", "佛山", "黄埔", "龙岗", "荔湾", "汕头", "广 东", "潮州", "茂名", "廣東",
                "廣州", "guangdong", "惠州", "清远", "中山", "湛江", "江门", "東莞", "Guangdong", "肇庆", "肇庆", "恩平",
            ),
            "海南省": (
                "海南", "海口", "海市", "五指山", "三亚",
            ),
            "四川省": (
                "四川", "成都", "都江堰", "四州省", "南部县", "青羊", "三台", "金牛", "绵阳", "广元市", "自贡", "泸州",
                "德阳", "资阳",
            ),
            "贵州省": (
                "贵州", "南明", "贵阳", "贵呀", "遵义", "六盘水", "铜仁",
            ),
            "云南省": (
                "云南", "云市省", "昆明", "西山", "大理", "玉溪",
            ),
            "陕西省": (
                "陕西", "西安", "莲湖", "秦都", "碑林", "耀州", "宝鸡", "金台", "凤翔", "xi'an", "榆林", "安康", "渭南",
                "延安",
            ),
            "甘肃省": (
                "甘肃", "兰州", "玉门", "嘉峪关",
            ),
            "青海省": (
                "青海", "果洛藏族", "西宁",
            ),
            "台湾省": (
                "台湾", "台北", "高雄", "台灣", "新北", "中和", "台中", "永和", "台南", "嘉義", "三重", "新竹", "新店",
                "汐止", "彰化", "板橋", "桃園", "樹林", "屏東", "鳳山",
            ),
            # 5自治区
            "内蒙古自治区": (
                "蒙古", "呼和浩特", "包头", "内蒙", "呼伦贝尔", "满洲里",
            ),
            "广西壮族自治区": (
                "广西", "南宁", "柳北", "柳南", "城中", "兴宁", "市宁", "青秀", "柳州", "桂林", "北流",
            ),
            "西藏自治区": (
                "西藏", "拉萨",
            ),
            "宁夏回族自治区": (
                "宁夏", "银川", "吴忠",
            ),
            "新疆维吾尔自治区": (
                "新疆", "乌鲁木齐", "吐鲁番", "博乐",
            ),
            # 2特别行政区
            "香港特别行政区": (
                "香港", "HK", "Hong Kong", "HONGKONG", "hong kong", "HongKong"
            ),
            "澳门特别行政区": (
                "澳门", "澳門",
            ),
            # extra
            "中国其它地区": (
                "中国", "CHN", "个人", "公司", "城区", "大厦", "中区", "开发区", "市区", "人民路", "高新", "港澳台",
            ),

            # 国外
            "美国": (
                "美国", "USA",
            ),
            "日本": (
                "日本", "JPN", "JAPAN", "大阪", "小樽", "北海道", "japan", "Tokyo", "広島",
            ),
            "澳大利亚": (
                "澳大利亚", "AUS",
            ),
            "新加坡": (
                "新加坡", "SGP", "Singapore", "Singapapore",
            ),
            "韩国": (
                "韩国", "KOR",
            ),
            "马来西亚": (
                "马来西亚", "MYS",
            ),
            "巴基斯坦": (
                "巴基斯坦",
            ),
            "新西兰": (
                "NZL", "新西兰",
            ),
            "加拿大": (
                "CAN", "canada",
            ),
            "英国": (
                "GBR", "LONDON", "UK",
            ),
            "挪威": (
                "NOR",
            ),
            "印度": (
                "印度", "IND",
            ),
            "俄罗斯": (
                "RUS",
            ),
            "白俄罗斯": (
                "BLR",
            ),
            "意大利": (
                "ITA", "意大利",
            ),
            "土耳其": (
                "TUR"
            ),
            "蒙古": (
                "MNG"
            ),
            "沙特阿拉伯": (
                "SAU",
            ),
            "印度尼西亚": (
                "IDN",
            ),
            "缅甸": (
                "缅甸",
            ),
            "德国": (
                "德国", "Germany",
            ),
            "捷克共和国": (
                "cze", "CZE",
            ),
            "巴西": (
                "BRAZIL",
            ),
            "朝鲜": (
                "朝鲜",
            ),
            "菲律宾": (
                "PHL",
            ),
        }

    def count(self, address_str: str):
        """
        判断是否为有效地址，如果有效就会在相应的计数器里加1
        :param address_str: 地址字符串
        :return: bool值，True表示有效，False表示无效
        """
        for region_name, region_alias_tuple in self.alias_dict.items():
            for region_alias in region_alias_tuple:
                if region_alias in address_str:
                    self.dict_counter[region_name] += 1
                    return True

        return False

    def get_result(self):
        return self.dict_counter


def main():
    input_path = r"d:\\address_2.txt"
    output_path = r"d:\\address_out.txt"
    total_lines_counter = 0
    not_handled_counter = 0
    counter = AddressCounter()

    f_out = open(output_path, mode="w", encoding="utf8")
    with open(input_path, mode='r', encoding='utf8') as f:
        while True:
            line = f.readline()
            if line == "":
                break
            total_lines_counter += 1
            if counter.count(line.strip("\n")) is False:
                not_handled_counter += 1
                f_out.write(line)
    f_out.close()
    print("total: {}, not_handled: {}".format(total_lines_counter, not_handled_counter))
    pprint.pprint(counter.get_result())


if __name__ == '__main__':
    main()
